adzierzanowski/ps2-to-usb/ps2-to-usb.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32F0
ProjectManager.MainLocation=Src
RCC.I2SFreq_Value=48000000
RCC.MCOFreq_Value=48000000
I2C2.IPParameters=Timing
Dma.I2C2_TX.1.Direction=DMA_MEMORY_TO_PERIPH
USB_DEVICE.CLASS_NAME_FS=HID
RCC.USART1Freq_Value=48000000
ProjectManager.ProjectFileName=ps2-to-usb.ioc
Dma.I2C2_RX.0.MemDataAlignment=DMA_MDATAALIGN_BYTE
ProjectManager.KeepUserCode=true
Mcu.PinsNb=8
Mcu.UserName=STM32F072C8Tx
NVIC.USB_IRQn=true\:0\:0\:false\:false\:true\:false\:true
PB10.Mode=I2C
ProjectManager.NoMain=false
USB_DEVICE.VirtualModeFS=Hid_FS
PB4.GPIO_ModeDefaultEXTI=GPIO_MODE_IT_FALLING
Dma.I2C2_RX.0.Priority=DMA_PRIORITY_LOW
RCC.PLLCLKFreq_Value=16000000
I2C2.Timing=0x20303E5D
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-MX_DMA_Init-DMA-false-HAL-true,3-SystemClock_Config-RCC-false-HAL-false,4-MX_USB_DEVICE_Init-USB_DEVICE-false-HAL-false,5-MX_USART1_UART_Init-USART1-false-HAL-true,6-MX_I2C2_Init-I2C2-false-HAL-true
PA11.Mode=Device
ProjectManager.DefaultFWLocation=true
RCC.USART2Freq_Value=48000000
Dma.I2C2_TX.1.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority
NVIC.SVC_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.DeletePrevious=true
PB11.Signal=I2C2_SDA
USB_DEVICE.IPParameters=VirtualMode,VirtualModeFS,CLASS_NAME_FS
PinOutPanel.RotationAngle=0
RCC.FamilyName=M
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_HSI48
ProjectManager.StackSize=0x400
PB5.GPIOParameters=GPIO_PuPd,GPIO_Label
Mcu.IP4=SYS
RCC.FCLKCortexFreq_Value=48000000
Mcu.IP5=USB
Mcu.IP2=NVIC
Mcu.IP3=RCC
PB4.GPIOParameters=GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultEXTI
Mcu.IP0=DMA
Mcu.IP1=I2C2
PA12.Signal=USB_DP
Dma.I2C2_TX.1.Instance=DMA1_Channel4
Mcu.UserConstants=
PB11.Mode=I2C
ProjectManager.TargetToolchain=Makefile
Mcu.ThirdPartyNb=0
NVIC.I2C2_IRQn=true\:1\:0\:true\:false\:true\:true\:true
RCC.HCLKFreq_Value=48000000
Dma.I2C2_RX.0.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
Mcu.IPNb=7
Dma.I2C2_RX.0.MemInc=DMA_MINC_ENABLE
ProjectManager.PreviousToolchain=
PB5.Locked=true
Mcu.Pin6=VP_SYS_VS_Systick
PB4.GPIO_PuPd=GPIO_PULLUP
Mcu.Pin7=VP_USB_DEVICE_VS_USB_DEVICE_HID_FS
ProjectManager.RegisterCallBack=
RCC.AHBFreq_Value=48000000
Mcu.Pin0=PB10
Mcu.Pin1=PB11
GPIO.groupedBy=Group By Peripherals
PB10.Signal=I2C2_SCL
Mcu.Pin2=PA11
Mcu.Pin3=PA12
Mcu.Pin4=PB4
Mcu.Pin5=PB5
ProjectManager.ProjectBuild=false
board=custom
NVIC.SysTick_IRQn=true\:3\:0\:true\:false\:true\:false\:true
ProjectManager.LastFirmware=true
RCC.VCOOutput2Freq_Value=8000000
ProjectManager.FirmwarePackage=STM32Cube FW_F0 V1.11.0
MxDb.Version=DB.6.0.0
VP_USB_DEVICE_VS_USB_DEVICE_HID_FS.Signal=USB_DEVICE_VS_USB_DEVICE_HID_FS
VP_USB_DEVICE_VS_USB_DEVICE_HID_FS.Mode=HID_FS
ProjectManager.BackupPrevious=false
MxCube.Version=6.0.0
PB4.GPIO_Label=CLK
NVIC.DMA1_Channel4_5_6_7_IRQn=true\:0\:0\:false\:false\:true\:false\:true
Dma.I2C2_TX.1.MemInc=DMA_MINC_ENABLE
Dma.I2C2_RX.0.Mode=DMA_NORMAL
File.Version=6
VP_SYS_VS_Systick.Mode=SysTick
Dma.I2C2_RX.0.Instance=DMA1_Channel5
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Dma.I2C2_RX.0.Direction=DMA_PERIPH_TO_MEMORY
ProjectManager.FreePins=false
RCC.IPParameters=AHBFreq_Value,APB1Freq_Value,APB1TimFreq_Value,CECFreq_Value,FCLKCortexFreq_Value,FamilyName,HCLKFreq_Value,HSICECFreq_Value,I2SFreq_Value,MCOFreq_Value,PLLCLKFreq_Value,PLLMCOFreq_Value,SYSCLKFreq_VALUE,SYSCLKSource,TimSysFreq_Value,USART1Freq_Value,USART2Freq_Value,VCOOutput2Freq_Value
ProjectManager.AskForMigrate=true
Mcu.Name=STM32F072C(8-B)Tx
Dma.RequestsNb=2
ProjectManager.HalAssertFull=false
Dma.I2C2_RX.0.PeriphInc=DMA_PINC_DISABLE
ProjectManager.ProjectName=ps2-to-usb
ProjectManager.UnderRoot=false
RCC.HSICECFreq_Value=32786.88524590164
Dma.I2C2_TX.1.MemDataAlignment=DMA_MDATAALIGN_BYTE
Mcu.IP6=USB_DEVICE
RCC.PLLMCOFreq_Value=16000000
ProjectManager.CoupleFile=true
PB4.Locked=true
RCC.SYSCLKFreq_VALUE=48000000
Mcu.Package=LQFP48
PB5.Signal=GPIO_Input
RCC.TimSysFreq_Value=48000000
PA12.Mode=Device
SH.GPXTI4.0=GPIO_EXTI4
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
Dma.I2C2_TX.1.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
PB5.GPIO_PuPd=GPIO_PULLUP
ProjectManager.CompilerOptimize=6
ProjectManager.ToolChainLocation=
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
PA11.Signal=USB_DM
ProjectManager.HeapSize=0x200
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Dma.I2C2_TX.1.PeriphInc=DMA_PINC_DISABLE
SH.GPXTI4.ConfNb=1
ProjectManager.ComputerToolchain=false
PB5.GPIO_Label=DIN
RCC.CECFreq_Value=32786.88524590164
Dma.Request1=I2C2_TX
RCC.APB1TimFreq_Value=48000000
Dma.I2C2_TX.1.Priority=DMA_PRIORITY_LOW
Dma.Request0=I2C2_RX
RCC.APB1Freq_Value=48000000
USB_DEVICE.VirtualMode=Hid
Dma.I2C2_RX.0.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority
Dma.I2C2_TX.1.Mode=DMA_NORMAL
ProjectManager.CustomerFirmwarePackage=
ProjectManager.DeviceId=STM32F072C8Tx
NVIC.EXTI4_15_IRQn=true\:0\:0\:false\:false\:true\:true\:true
ProjectManager.LibraryCopy=1
PB4.Signal=GPXTI4
